Community-PIO-CH32V/ArduinoCore-CH32H4/boards.txt
# Arduino IDE board definitions for the CH32H41x.
#
# GENERATED BY tools/makeboards.py -- edit that and re-run it, not this file.
#
# PlatformIO does not read this: it uses the board JSON in platform-ch32v and
# tools/platformio-build.py. The two are two statements of the same build, and
# the flash layout in both comes from the same numbers.

menu.usbstack=USB stack
menu.serial=Serial port
menu.exceptions=C++ Exceptions
menu.lto=Link-time optimization
menu.castore=CA trust store
menu.fs=Filesystem size

# --------------------------------------------------------------------------
# CH32H417QEU6-R0-1v1
# --------------------------------------------------------------------------
ch32h417qeu6.name=CH32H417QEU6-R0-1v1
ch32h417qeu6.build.core=ch32h4
ch32h417qeu6.build.variant=CH32H417QEU6_EVT_R0
ch32h417qeu6.build.package=CH32H417QEU6
ch32h417qeu6.build.mcu=ch32h417qeu6
ch32h417qeu6.build.f_cpu=400000000L
ch32h417qeu6.build.board=CH32H417QEU6
ch32h417qeu6.build.march=rv32imafc_zba_zbb_zbc_zbs_xw
ch32h417qeu6.build.mabi=ilp32f
ch32h417qeu6.build.flags.clock=-DSYSCLK_400M_CoreCLK_V5F_400M_V3F_100M_HSE=400000000
ch32h417qeu6.build.svd=CH32H417xx.svd
ch32h417qeu6.upload.tool=wlink
ch32h417qeu6.upload.tool.default=wlink
ch32h417qeu6.upload.tool.network=espota
ch32h417qeu6.upload.protocol=wlink
ch32h417qeu6.upload.maximum_data_size=917504

# The USB device stack, independent of what `Serial` is.
#
# These were one menu until it became clear they are two questions. A sketch
# can want TinyUSB for HID or MSC while keeping the console on the UART, and a
# sketch that needs neither should not pay for a USB stack it never calls --
# roughly 15 KB of flash and the RAM its buffers sit in.
#
# None also removes the reason a sketch must include Adafruit_TinyUSB.h: with
# no stack there is nothing for the library-detection pass to find.
ch32h417qeu6.menu.usbstack.tinyusb=Adafruit TinyUSB
ch32h417qeu6.menu.usbstack.tinyusb.build.flags.usbstack=-DCH32H4_USB -DUSE_TINYUSB
ch32h417qeu6.menu.usbstack.none=None
ch32h417qeu6.menu.usbstack.none.build.flags.usbstack=

# What `Serial` refers to. Serial1 is always USART1 on PA9/PA10, into the
# WCH-Link's VCP, whichever is chosen here.
#
# USB CDC is the default, as in the PlatformIO build, because it is what
# someone plugging the board into a PC expects to find. It needs the USB stack
# menu set to Adafruit TinyUSB; choosing None with USB CDC is refused by
# Arduino.h rather than silently giving you the UART, which is what it used to
# do.
#
# The USART1 option is worth keeping whatever the USB stack is: a fault during
# static initialisation happens before USB has enumerated, so a board that only
# speaks CDC cannot report one.
ch32h417qeu6.menu.serial.usb=USB CDC
ch32h417qeu6.menu.serial.usb.build.flags.serial=-DCH32H4_SERIAL_IS_USB
ch32h417qeu6.menu.serial.uart=USART1
ch32h417qeu6.menu.serial.uart.build.flags.serial=

# Off by default, as in arduino-pico and the ESP cores. Enabling costs roughly
# 30 KB of unwind tables, which stay in flash and are read only when something
# throws.
#
# NOTE: --specs=nano.specs must never be added to make up the difference. It
# rewrites -lstdc++ to -lstdc++_nano, which has no .eh_frame, and every throw
# then reaches std::terminate -- after a perfectly clean link, with the failure
# visible only at run time.
ch32h417qeu6.menu.exceptions.Disabled=Disabled
ch32h417qeu6.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
ch32h417qeu6.menu.exceptions.Disabled.build.flags.exceptions.define=
ch32h417qeu6.menu.exceptions.Enabled=Enabled
ch32h417qeu6.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
ch32h417qeu6.menu.exceptions.Enabled.build.flags.exceptions.define=-DCH32H4_EXCEPTIONS

# Link-time optimization: the whole image optimized as one unit.
#
# It is worth 3-7% of flash here, more on the large builds -- 24 KB off a TLS
# sketch -- because the SDK, lwIP, mbedTLS and the Arduino layer are separate
# archives, and without it every call across one of those boundaries is a real
# call to a function nothing can inline.
#
# On by default, and the same default PlatformIO uses -- the two build
# descriptions should not produce differently optimized images from the same
# source.
#
# The one thing that was ever build-system-specific here is gone: the linker
# script used to place TinyUSB's buffers by matching the object FILENAME, which
# LTO erases, and arduino-cli never matched anyway. They are placed by section
# now, which means the same thing under both and under LTO. Verified on
# hardware from an arduino-cli-built image: USB CDC enumerates and transfers.
#
# Disabled is here for the two occasions it is worth having: a fault whose
# backtrace is unreadable because everything inlined, and a suspicion that LTO
# itself is the bug.
ch32h417qeu6.menu.lto.Enabled=Enabled
ch32h417qeu6.menu.lto.Enabled.build.flags.lto=-flto
ch32h417qeu6.menu.lto.Disabled=Disabled
ch32h417qeu6.menu.lto.Disabled.build.flags.lto=

# The built-in CA trust store.
#
# None is the default, and means a TLS client trusts nothing until the sketch
# names a root with setCACert(). That keeps the trust decision visible in the
# sketch, at the cost of pasting a certificate in -- and of it expiring.
#
# The sizes are FLASH, not RAM. The store stays as DER and a callback parses
# only the root whose subject matches the server's issuer, one per handshake,
# so the full store costs no more RAM than the minimal one. See
# libraries/EthernetClientSecure/src/CATrustStore.h.
#
# Minimal is not a guess: every root in it was either read off a real
# station's certificate chain or is one of the general-purpose roots public
# APIs chain to. tools/gencertstore.py regenerates both from the current
# Mozilla bundle and reports any root that has left it.
#
# setCACert() still wins over either store. A sketch that named one root
# wanted that root, and a build flag should not widen it.
ch32h417qeu6.menu.castore.None=None (sketch supplies the root)
ch32h417qeu6.menu.castore.None.build.flags.castore=
ch32h417qeu6.menu.castore.Minimal=Minimal (15 roots, ~13 KB flash)
ch32h417qeu6.menu.castore.Minimal.build.flags.castore=-DCH32H4_CA_STORE=1
ch32h417qeu6.menu.castore.Full=Full Mozilla set (121 roots, ~126 KB flash)
ch32h417qeu6.menu.castore.Full.build.flags.castore=-DCH32H4_CA_STORE=2

# The filesystem partition, immediately below the 16 KB EEPROM at the top of
# flash. LittleFS mounts it; tools/simplesub.py substitutes the size into the
# linker script, which then ASSERTs that the sketch region, the filesystem and
# the EEPROM tile the 983040-byte user area exactly.
#
# The EEPROM is NOT part of this menu. It is always present and always the last
# 16384 bytes, so that a sketch's stored settings survive a change of
# filesystem size -- which arduino-pico does the same way and for the same
# reason.
ch32h417qeu6.menu.fs.128k=128 KB
ch32h417qeu6.menu.fs.128k.build.fs_size=131072
ch32h417qeu6.menu.fs.128k.upload.maximum_size=802816
ch32h417qeu6.menu.fs.0k=None
ch32h417qeu6.menu.fs.0k.build.fs_size=0
ch32h417qeu6.menu.fs.0k.upload.maximum_size=933888
ch32h417qeu6.menu.fs.64k=64 KB
ch32h417qeu6.menu.fs.64k.build.fs_size=65536
ch32h417qeu6.menu.fs.64k.upload.maximum_size=868352
ch32h417qeu6.menu.fs.256k=256 KB
ch32h417qeu6.menu.fs.256k.build.fs_size=262144
ch32h417qeu6.menu.fs.256k.upload.maximum_size=671744
ch32h417qeu6.menu.fs.512k=512 KB
ch32h417qeu6.menu.fs.512k.build.fs_size=524288
ch32h417qeu6.menu.fs.512k.upload.maximum_size=409600

ch32h417qeu6.build.fs_size=131072
ch32h417qeu6.upload.maximum_size=802816
